// داده‌های نمونه اساتید
const professors = [
    {
      id: 1,
      name: "دکتر احمدی",
      image: "assets/web-dev.jpg",
      field: "برنامه‌نویسی پیشرفته",
      bio: "استاد برجسته حوزه برنامه‌نویسی با ۱۵ سال سابقه تدریس",
      classes: ["پایتون پیشرفته", "الگوریتم‌ها", "هوش مصنوعی"],
    },
    {
      id: 2,
      name: "دکتر مملی",
      image: "assets/web-dev.jpg",
      field: "برنامه‌نویسی پیشرفته",
      bio: "استاد برجسته حوزه برنامه‌نویسی با ۱۵ سال سابقه تدریس",
      classes: ["پایتون پیشرفته", "الگوریتم‌ها", "هوش مصنوعی"],
    },
    {
      id: 3,
      name: "دکتر احمدی",
      image: "assets/mobi-img.jpg",
      field: "برنامه‌نویسی پیشرفته",
      bio: "استاد برجسته حوزه برنامه‌نویسی با ۱۵ سال سابقه تدریس",
      classes: ["پایتون پیشرفته", "الگوریتم‌ها", "هوش مصنوعی"],
    },
  ];
  